In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("weather_data.csv")

In [3]:
df

          Date  Temperature Weather
0   2024-07-01         25.0   Sunny
1   2024-07-02         30.0  Cloudy
2   2024-07-03          NaN   Rainy
3   2024-07-04         28.0   Sunny
4   2024-07-05         29.0     NaN
5   2024-07-06         31.0   Sunny
6   2024-07-07          NaN  Cloudy
7   2024-07-08         27.0   Rainy
8   2024-07-09         26.0   Sunny
9   2024-07-10         30.0     NaN
10  2024-07-11         29.0   Sunny
11  2024-07-12         28.0  Cloudy
12  2024-07-13          NaN   Rainy
13  2024-07-14         27.0   Sunny
14  2024-07-15         26.0  Cloudy

In [4]:
df.describe()

       Temperature
count    12.000000
mean     28.000000
std       1.858641
min      25.000000
25%      26.750000
50%      28.000000
75%      29.250000
max      31.000000

In [5]:
df['Temperature'].mean()

28.0